/* automatically generated by rust-bindgen 0.64.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const CONF_PORTB_EVCTRL_PORTEI_2: u32 = 0;
pub const CONF_PORTB_EVCTRL_PID_2: u32 = 0;
pub const CONF_PORTB_EVCTRL_EVACT_2: u32 = 0;
pub const CONF_PORT_EVCTRL_PORT_3: u32 = 0;
pub const CONF_PORTA_EVCTRL_PORTEI_3: u32 = 0;
pub const CONF_PORTA_EVCTRL_PID_3: u32 = 0;
pub const CONF_PORTA_EVCTRL_EVACT_3: u32 = 0;
pub const CONF_PORTB_EVCTRL_PORTEI_3: u32 = 0;
pub const CONF_PORTB_EVCTRL_PID_3: u32 = 0;
pub const CONF_PORTB_EVCTRL_EVACT_3: u32 = 0;
pub const I2C_M_RD: u32 = 1;
pub const I2C_M_BUSY: u32 = 256;
pub const I2C_M_TEN: u32 = 1024;
pub const I2C_M_SEVEN: u32 = 2048;
pub const I2C_M_FAIL: u32 = 4096;
pub const I2C_M_STOP: u32 = 32768;
pub const I2C_OK: u32 = 0;
pub const I2C_ACK: i32 = -1;
pub const I2C_NACK: i32 = -2;
pub const I2C_ERR_ARBLOST: i32 = -3;
pub const I2C_ERR_BAD_ADDRESS: i32 = -4;
pub const I2C_ERR_BUS: i32 = -5;
pub const I2C_ERR_BUSY: i32 = -6;
pub const I2c_ERR_PACKAGE_COLLISION: i32 = -7;
pub const I2C_STANDARD_MODE: u32 = 0;
pub const I2C_FASTMODE: u32 = 1;
pub const I2C_HIGHSPEED_MODE: u32 = 2;
pub const I2C_M_MAX_RETRY: u32 = 1;
pub const SPI_DUMMY_CHAR: u32 = 511;
pub const WATCH_RTC_REFERENCE_YEAR: u32 = 2020;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::core::ffi::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::core::ffi::c_uint,
    pub __wchb: [::core::ffi::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos64_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::core::ffi::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::core::ffi::c_int,
    pub _IO_read_ptr: *mut ::core::ffi::c_char,
    pub _IO_read_end: *mut ::core::ffi::c_char,
    pub _IO_read_base: *mut ::core::ffi::c_char,
    pub _IO_write_base: *mut ::core::ffi::c_char,
    pub _IO_write_ptr: *mut ::core::ffi::c_char,
    pub _IO_write_end: *mut ::core::ffi::c_char,
    pub _IO_buf_base: *mut ::core::ffi::c_char,
    pub _IO_buf_end: *mut ::core::ffi::c_char,
    pub _IO_save_base: *mut ::core::ffi::c_char,
    pub _IO_backup_base: *mut ::core::ffi::c_char,
    pub _IO_save_end: *mut ::core::ffi::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::core::ffi::c_int,
    pub _flags2: ::core::ffi::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::core::ffi::c_ushort,
    pub _vtable_offset: ::core::ffi::c_schar,
    pub _shortbuf: [::core::ffi::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::core::ffi::c_void,
    pub __pad5: usize,
    pub _mode: ::core::ffi::c_int,
    pub _unused2: [::core::ffi::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_FILE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::core::ffi::c_char,
        __new: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::core::ffi::c_int,
        __old: *const ::core::ffi::c_char,
        __newfd: ::core::ffi::c_int,
        __new: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::core::ffi::c_char,
        __pfx: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::core::ffi::c_char,
        __modes: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::core::ffi::c_char,
        __modes: *const ::core::ffi::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::core::ffi::c_int, __modes: *const ::core::ffi::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::core::ffi::c_void,
        __len: usize,
        __modes: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::core::ffi::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::core::ffi::c_char,
        __modes: ::core::ffi::c_int,
        __n: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::core::ffi::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::core::ffi::c_char,
        __maxlen: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::core::ffi::c_char,
        __maxlen: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::core::ffi::c_int,
        __fmt: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::core::ffi::c_int,
        __fmt: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fputc(__c: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putc(__c: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putw(__w: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::core::ffi::c_char,
        __n: ::core::ffi::c_int,
        __stream: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::core::ffi::c_char,
        __n: *mut usize,
        __delimiter: ::core::ffi::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::core::ffi::c_char,
        __n: *mut usize,
        __delimiter: ::core::ffi::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::core::ffi::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::core::ffi::c_char, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::core::ffi::c_int, __stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __n: ::core::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __n: ::core::ffi::c_ulong,
        __s: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::core::ffi::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::core::ffi::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::core::ffi::c_long,
        __whence: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::core::ffi::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::core::ffi::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::core::ffi::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::core::ffi::c_char,
        __modes: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type wchar_t = ::core::ffi::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type RoReg = u32;
pub type RoReg16 = u16;
pub type RoReg8 = u8;
pub type WoReg = u32;
pub type WoReg16 = u16;
pub type WoReg8 = u8;
pub type RwReg = u32;
pub type RwReg16 = u16;
pub type RwReg8 = u8;
#[doc = "<  2 Non Maskable Interrupt"]
pub const IRQn_NonMaskableInt_IRQn: IRQn = -14;
#[doc = "<  3 Hard Fault Interrupt"]
pub const IRQn_HardFault_IRQn: IRQn = -13;
#[doc = "< 11 SV Call Interrupt"]
pub const IRQn_SVCall_IRQn: IRQn = -5;
#[doc = "< 14 Pend SV Interrupt"]
pub const IRQn_PendSV_IRQn: IRQn = -2;
#[doc = "< 15 System Tick Interrupt"]
pub const IRQn_SysTick_IRQn: IRQn = -1;
#[doc = "<  0 SAML22J18A System Interrupts"]
pub const IRQn_SYSTEM_IRQn: IRQn = 0;
#[doc = "<  1 SAML22J18A Watchdog Timer (WDT)"]
pub const IRQn_WDT_IRQn: IRQn = 1;
#[doc = "<  2 SAML22J18A Real-Time Counter (RTC)"]
pub const IRQn_RTC_IRQn: IRQn = 2;
#[doc = "<  3 SAML22J18A External Interrupt Controller (EIC)"]
pub const IRQn_EIC_IRQn: IRQn = 3;
#[doc = "<  4 SAML22J18A Frequency Meter (FREQM)"]
pub const IRQn_FREQM_IRQn: IRQn = 4;
#[doc = "<  5 SAML22J18A Universal Serial Bus (USB)"]
pub const IRQn_USB_IRQn: IRQn = 5;
#[doc = "<  6 SAML22J18A Non-Volatile Memory Controller (NVMCTRL)"]
pub const IRQn_NVMCTRL_IRQn: IRQn = 6;
#[doc = "<  7 SAML22J18A Direct Memory Access Controller (DMAC)"]
pub const IRQn_DMAC_IRQn: IRQn = 7;
#[doc = "<  8 SAML22J18A Event System Interface (EVSYS)"]
pub const IRQn_EVSYS_IRQn: IRQn = 8;
#[doc = "<  9 SAML22J18A Serial Communication Interface 0 (SERCOM0)"]
pub const IRQn_SERCOM0_IRQn: IRQn = 9;
#[doc = "< 10 SAML22J18A Serial Communication Interface 1 (SERCOM1)"]
pub const IRQn_SERCOM1_IRQn: IRQn = 10;
#[doc = "< 11 SAML22J18A Serial Communication Interface 2 (SERCOM2)"]
pub const IRQn_SERCOM2_IRQn: IRQn = 11;
#[doc = "< 12 SAML22J18A Serial Communication Interface 3 (SERCOM3)"]
pub const IRQn_SERCOM3_IRQn: IRQn = 12;
#[doc = "< 15 SAML22J18A Timer Counter Control (TCC0)"]
pub const IRQn_TCC0_IRQn: IRQn = 15;
#[doc = "< 16 SAML22J18A Basic Timer Counter 0 (TC0)"]
pub const IRQn_TC0_IRQn: IRQn = 16;
#[doc = "< 17 SAML22J18A Basic Timer Counter 1 (TC1)"]
pub const IRQn_TC1_IRQn: IRQn = 17;
#[doc = "< 18 SAML22J18A Basic Timer Counter 2 (TC2)"]
pub const IRQn_TC2_IRQn: IRQn = 18;
#[doc = "< 19 SAML22J18A Basic Timer Counter 3 (TC3)"]
pub const IRQn_TC3_IRQn: IRQn = 19;
#[doc = "< 20 SAML22J18A Analog Digital Converter (ADC)"]
pub const IRQn_ADC_IRQn: IRQn = 20;
#[doc = "< 21 SAML22J18A Analog Comparators (AC)"]
pub const IRQn_AC_IRQn: IRQn = 21;
#[doc = "< 22 SAML22J18A Peripheral Touch Controller (PTC)"]
pub const IRQn_PTC_IRQn: IRQn = 22;
#[doc = "< 23 SAML22J18A Segment Liquid Crystal Display Controller (SLCD)"]
pub const IRQn_SLCD_IRQn: IRQn = 23;
#[doc = "< 24 SAML22J18A Advanced Encryption Standard (AES)"]
pub const IRQn_AES_IRQn: IRQn = 24;
#[doc = "< 25 SAML22J18A True Random Generator (TRNG)"]
pub const IRQn_TRNG_IRQn: IRQn = 25;
#[doc = "< Number of peripheral IDs"]
pub const IRQn_PERIPH_COUNT_IRQn: IRQn = 26;
#[doc = " Interrupt Number Definition"]
pub type IRQn = ::core::ffi::c_int;
#[doc = " Interrupt Number Definition"]
pub use self::IRQn as IRQn_Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DeviceVectors {
    pub pvStack: *mut ::core::ffi::c_void,
    pub pfnReset_Handler: *mut ::core::ffi::c_void,
    pub pfnNonMaskableInt_Handler: *mut ::core::ffi::c_void,
    pub pfnHardFault_Handler: *mut ::core::ffi::c_void,
    pub pvReservedM12: *mut ::core::ffi::c_void,
    pub pvReservedM11: *mut ::core::ffi::c_void,
    pub pvReservedM10: *mut ::core::ffi::c_void,
    pub pvReservedM9: *mut ::core::ffi::c_void,
    pub pvReservedM8: *mut ::core::ffi::c_void,
    pub pvReservedM7: *mut ::core::ffi::c_void,
    pub pvReservedM6: *mut ::core::ffi::c_void,
    pub pfnSVCall_Handler: *mut ::core::ffi::c_void,
    pub pvReservedM4: *mut ::core::ffi::c_void,
    pub pvReservedM3: *mut ::core::ffi::c_void,
    pub pfnPendSV_Handler: *mut ::core::ffi::c_void,
    pub pfnSysTick_Handler: *mut ::core::ffi::c_void,
    pub pfnSYSTEM_Handler: *mut ::core::ffi::c_void,
    pub pfnWDT_Handler: *mut ::core::ffi::c_void,
    pub pfnRTC_Handler: *mut ::core::ffi::c_void,
    pub pfnEIC_Handler: *mut ::core::ffi::c_void,
    pub pfnFREQM_Handler: *mut ::core::ffi::c_void,
    pub pfnUSB_Handler: *mut ::core::ffi::c_void,
    pub pfnNVMCTRL_Handler: *mut ::core::ffi::c_void,
    pub pfnDMAC_Handler: *mut ::core::ffi::c_void,
    pub pfnEVSYS_Handler: *mut ::core::ffi::c_void,
    pub pfnSERCOM0_Handler: *mut ::core::ffi::c_void,
    pub pfnSERCOM1_Handler: *mut ::core::ffi::c_void,
    pub pfnSERCOM2_Handler: *mut ::core::ffi::c_void,
    pub pfnSERCOM3_Handler: *mut ::core::ffi::c_void,
    pub pvReserved13: *mut ::core::ffi::c_void,
    pub pvReserved14: *mut ::core::ffi::c_void,
    pub pfnTCC0_Handler: *mut ::core::ffi::c_void,
    pub pfnTC0_Handler: *mut ::core::ffi::c_void,
    pub pfnTC1_Handler: *mut ::core::ffi::c_void,
    pub pfnTC2_Handler: *mut ::core::ffi::c_void,
    pub pfnTC3_Handler: *mut ::core::ffi::c_void,
    pub pfnADC_Handler: *mut ::core::ffi::c_void,
    pub pfnAC_Handler: *mut ::core::ffi::c_void,
    pub pfnPTC_Handler: *mut ::core::ffi::c_void,
    pub pfnSLCD_Handler: *mut ::core::ffi::c_void,
    pub pfnAES_Handler: *mut ::core::ffi::c_void,
    pub pfnTRNG_Handler: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout__DeviceVectors() {
    const UNINIT: ::core::mem::MaybeUninit<_DeviceVectors> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DeviceVectors>(),
        336usize,
        concat!("Size of: ", stringify!(_DeviceVectors))
    );
    assert_eq!(
        ::core::mem::align_of::<_DeviceVectors>(),
        8usize,
        concat!("Alignment of ", stringify!(_DeviceVectors))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvStack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvStack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnReset_Handler) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnReset_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnNonMaskableInt_Handler) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnNonMaskableInt_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnHardFault_Handler) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnHardFault_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM12) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM12)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM11) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM11)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM10) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM10)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM9) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM8) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM7) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM6) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSVCall_Handler) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSVCall_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM4) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReservedM3) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnPendSV_Handler) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnPendSV_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSysTick_Handler) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSysTick_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSYSTEM_Handler) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSYSTEM_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnWDT_Handler) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnWDT_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnRTC_Handler) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnRTC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnEIC_Handler) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnEIC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnFREQM_Handler) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnFREQM_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnUSB_Handler) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnUSB_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnNVMCTRL_Handler) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnNVMCTRL_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnDMAC_Handler) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnDMAC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnEVSYS_Handler) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnEVSYS_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSERCOM0_Handler) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM0_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSERCOM1_Handler) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM1_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSERCOM2_Handler) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM2_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSERCOM3_Handler) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM3_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReserved13) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved13)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pvReserved14) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved14)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTCC0_Handler) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTCC0_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTC0_Handler) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC0_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTC1_Handler) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC1_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTC2_Handler) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC2_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTC3_Handler) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC3_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnADC_Handler) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnADC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnAC_Handler) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnAC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnPTC_Handler) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnPTC_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnSLCD_Handler) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSLCD_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnAES_Handler) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnAES_Handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pfnTRNG_Handler) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTRNG_Handler)
        )
    );
}
pub type DeviceVectors = _DeviceVectors;
extern "C" {
    pub fn Reset_Handler();
}
extern "C" {
    pub fn NonMaskableInt_Handler();
}
extern "C" {
    pub fn HardFault_Handler();
}
extern "C" {
    pub fn SVCall_Handler();
}
extern "C" {
    pub fn PendSV_Handler();
}
extern "C" {
    pub fn SysTick_Handler();
}
extern "C" {
    pub fn SYSTEM_Handler();
}
extern "C" {
    pub fn WDT_Handler();
}
extern "C" {
    pub fn RTC_Handler();
}
extern "C" {
    pub fn EIC_Handler();
}
extern "C" {
    pub fn FREQM_Handler();
}
extern "C" {
    pub fn USB_Handler();
}
extern "C" {
    pub fn NVMCTRL_Handler();
}
extern "C" {
    pub fn DMAC_Handler();
}
extern "C" {
    pub fn EVSYS_Handler();
}
extern "C" {
    pub fn SERCOM0_Handler();
}
extern "C" {
    pub fn SERCOM1_Handler();
}
extern "C" {
    pub fn SERCOM2_Handler();
}
extern "C" {
    pub fn SERCOM3_Handler();
}
extern "C" {
    pub fn TCC0_Handler();
}
extern "C" {
    pub fn TC0_Handler();
}
extern "C" {
    pub fn TC1_Handler();
}
extern "C" {
    pub fn TC2_Handler();
}
extern "C" {
    pub fn TC3_Handler();
}
extern "C" {
    pub fn ADC_Handler();
}
extern "C" {
    pub fn AC_Handler();
}
extern "C" {
    pub fn PTC_Handler();
}
extern "C" {
    pub fn SLCD_Handler();
}
extern "C" {
    pub fn AES_Handler();
}
extern "C" {
    pub fn TRNG_Handler();
}
#[doc = " \\brief  Union type to access the Application Program Status Register (APSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: APSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type__bindgen_ty_1))
    );
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 27u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<APSR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<APSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[doc = " \\brief  Union type to access the Interrupt Program Status Register (IPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: IPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type__bindgen_ty_1))
    );
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<IPSR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[doc = " \\brief  Union type to access the Special-Purpose Program Status Registers (xPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: xPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type__bindgen_ty_1))
    );
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn IT(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_IT(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        T: u32,
        IT: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 15u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 2u8, {
            let IT: u32 = unsafe { ::core::mem::transmute(IT) };
            IT as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<xPSR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[doc = " \\brief  Union type to access the Control Registers (CONTROL)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: CONTROL_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FPCA(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FPCA(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        FPCA: u32,
        _reserved0: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::core::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FPCA: u32 = unsafe { ::core::mem::transmute(FPCA) };
            FPCA as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<CONTROL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(w)
        )
    );
}
#[doc = " \\brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVIC_Type {
    #[doc = "< Offset: 0x000 (R/W)  Interrupt Set Enable Register"]
    pub ISER: [u32; 1usize],
    pub RESERVED0: [u32; 31usize],
    #[doc = "< Offset: 0x080 (R/W)  Interrupt Clear Enable Register"]
    pub ICER: [u32; 1usize],
    pub RSERVED1: [u32; 31usize],
    #[doc = "< Offset: 0x100 (R/W)  Interrupt Set Pending Register"]
    pub ISPR: [u32; 1usize],
    pub RESERVED2: [u32; 31usize],
    #[doc = "< Offset: 0x180 (R/W)  Interrupt Clear Pending Register"]
    pub ICPR: [u32; 1usize],
    pub RESERVED3: [u32; 31usize],
    pub RESERVED4: [u32; 64usize],
    #[doc = "< Offset: 0x300 (R/W)  Interrupt Priority Register"]
    pub IP: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    const UNINIT: ::core::mem::MaybeUninit<NVIC_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<NVIC_Type>(),
        800usize,
        concat!("Size of: ", stringify!(NVIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<NVIC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(NVIC_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISER) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICER) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RSERVED1) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RSERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISPR) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICPR) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IP) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IP)
        )
    );
}
#[doc = " \\brief  Structure type to access the System Control Block (SCB)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCB_Type {
    #[doc = "< Offset: 0x000 (R/ )  CPUID Base Register"]
    pub CPUID: u32,
    #[doc = "< Offset: 0x004 (R/W)  Interrupt Control and State Register"]
    pub ICSR: u32,
    #[doc = "< Offset: 0x008 (R/W)  Vector Table Offset Register"]
    pub VTOR: u32,
    #[doc = "< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register"]
    pub AIRCR: u32,
    #[doc = "< Offset: 0x010 (R/W)  System Control Register"]
    pub SCR: u32,
    #[doc = "< Offset: 0x014 (R/W)  Configuration Control Register"]
    pub CCR: u32,
    pub RESERVED1: u32,
    #[doc = "< Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED"]
    pub SHP: [u32; 2usize],
    #[doc = "< Offset: 0x024 (R/W)  System Handler Control and State Register"]
    pub SHCSR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<SCB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SCB_Type>(),
        40usize,
        concat!("Size of: ", stringify!(SCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CPUID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPUID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ICSR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ICSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).VTOR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(VTOR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AIRCR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AIRCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SCR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHP) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SHCSR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHCSR)
        )
    );
}
#[doc = " \\brief  Structure type to access the System Timer (SysTick)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SysTick_Type {
    #[doc = "< Offset: 0x000 (R/W)  SysTick Control and Status Register"]
    pub CTRL: u32,
    #[doc = "< Offset: 0x004 (R/W)  SysTick Reload Value Register"]
    pub LOAD: u32,
    #[doc = "< Offset: 0x008 (R/W)  SysTick Current Value Register"]
    pub VAL: u32,
    #[doc = "< Offset: 0x00C (R/ )  SysTick Calibration Register"]
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    const UNINIT: ::core::mem::MaybeUninit<SysTick_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SysTick_Type>(),
        16usize,
        concat!("Size of: ", stringify!(SysTick_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SysTick_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SysTick_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LOAD) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(LOAD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).VAL) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(VAL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CALIB) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CALIB)
        )
    );
}
#[doc = " \\brief  Structure type to access the Memory Protection Unit (MPU)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPU_Type {
    #[doc = "< Offset: 0x000 (R/ )  MPU Type Register"]
    pub TYPE: u32,
    #[doc = "< Offset: 0x004 (R/W)  MPU Control Register"]
    pub CTRL: u32,
    #[doc = "< Offset: 0x008 (R/W)  MPU Region RNRber Register"]
    pub RNR: u32,
    #[doc = "< Offset: 0x00C (R/W)  MPU Region Base Address Register"]
    pub RBAR: u32,
    #[doc = "< Offset: 0x010 (R/W)  MPU Region Attribute and Size Register"]
    pub RASR: u32,
}
#[test]
fn bindgen_test_layout_MPU_Type() {
    const UNINIT: ::core::mem::MaybeUninit<MPU_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<MPU_Type>(),
        20usize,
        concat!("Size of: ", stringify!(MPU_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<MPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(MPU_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TYPE) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(TYPE)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RNR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RNR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RBAR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RASR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR)
        )
    );
}
extern "C" {
    #[doc = "< System Clock Frequency (Core Clock)"]
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLA_Type__bindgen_ty_1))
    );
}
impl AC_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SWRST: u8, ENABLE: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_CTRLA_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_CTRLA_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLA_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_CTRLB_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type__bindgen_ty_1))
    );
}
impl AC_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn START0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn START1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(START0: u8, START1: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let START0: u8 = unsafe { ::core::mem::transmute(START0) };
            START0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let START1: u8 = unsafe { ::core::mem::transmute(START1) };
            START1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLB_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type__bindgen_ty_2))
    );
}
impl AC_CTRLB_Type__bindgen_ty_2 {
    #[inline]
    pub fn START(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_START(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(START: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let START: u8 = unsafe { ::core::mem::transmute(START) };
            START as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_CTRLB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_EVCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_EVCTRL_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_EVCTRL_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct AC_EVCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type__bindgen_ty_1))
    );
}
impl AC_EVCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMPEO0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEO1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINEO0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINEO0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn INVEI0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_INVEI0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn INVEI1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_INVEI1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMPEO0: u16,
        COMPEO1: u16,
        WINEO0: u16,
        COMPEI0: u16,
        COMPEI1: u16,
        INVEI0: u16,
        INVEI1: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMPEO0: u16 = unsafe { ::core::mem::transmute(COMPEO0) };
            COMPEO0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMPEO1: u16 = unsafe { ::core::mem::transmute(COMPEO1) };
            COMPEO1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WINEO0: u16 = unsafe { ::core::mem::transmute(WINEO0) };
            WINEO0 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let COMPEI0: u16 = unsafe { ::core::mem::transmute(COMPEI0) };
            COMPEI0 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let COMPEI1: u16 = unsafe { ::core::mem::transmute(COMPEI1) };
            COMPEI1 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let INVEI0: u16 = unsafe { ::core::mem::transmute(INVEI0) };
            INVEI0 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let INVEI1: u16 = unsafe { ::core::mem::transmute(INVEI1) };
            INVEI1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct AC_EVCTRL_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type__bindgen_ty_2))
    );
}
impl AC_EVCTRL_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMPEO(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WINEO(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINEO(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn INVEI(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_INVEI(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMPEO: u16,
        WINEO: u16,
        COMPEI: u16,
        INVEI: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMPEO: u16 = unsafe { ::core::mem::transmute(COMPEO) };
            COMPEO as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WINEO: u16 = unsafe { ::core::mem::transmute(WINEO) };
            WINEO as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let COMPEI: u16 = unsafe { ::core::mem::transmute(COMPEI) };
            COMPEI as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let INVEI: u16 = unsafe { ::core::mem::transmute(INVEI) };
            INVEI as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_EVCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTENCLR_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type__bindgen_ty_1))
    );
}
impl AC_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP0: u8, COMP1: u8, WIN0: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENCLR_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type__bindgen_ty_2))
    );
}
impl AC_INTENCLR_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_INTENCLR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTENSET_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type__bindgen_ty_1))
    );
}
impl AC_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP0: u8, COMP1: u8, WIN0: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENSET_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type__bindgen_ty_2))
    );
}
impl AC_INTENSET_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_INTENSET_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTFLAG_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type__bindgen_ty_1))
    );
}
impl AC_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP0: u8, COMP1: u8, WIN0: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTFLAG_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type__bindgen_ty_2))
    );
}
impl AC_INTFLAG_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_INTFLAG_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_STATUSA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_STATUSA_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_STATUSA_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSA_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type__bindgen_ty_1))
    );
}
impl AC_STATUSA_Type__bindgen_ty_1 {
    #[inline]
    pub fn STATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STATE1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WSTATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WSTATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        STATE0: u8,
        STATE1: u8,
        WSTATE0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let STATE0: u8 = unsafe { ::core::mem::transmute(STATE0) };
            STATE0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let STATE1: u8 = unsafe { ::core::mem::transmute(STATE1) };
            STATE1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let WSTATE0: u8 = unsafe { ::core::mem::transmute(WSTATE0) };
            WSTATE0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSA_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type__bindgen_ty_2))
    );
}
impl AC_STATUSA_Type__bindgen_ty_2 {
    #[inline]
    pub fn STATE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_STATE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(STATE: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let STATE: u8 = unsafe { ::core::mem::transmute(STATE) };
            STATE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_STATUSA_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_STATUSB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_STATUSB_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_STATUSB_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSB_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type__bindgen_ty_1))
    );
}
impl AC_STATUSB_Type__bindgen_ty_1 {
    #[inline]
    pub fn READY0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_READY0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn READY1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_READY1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(READY0: u8, READY1: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let READY0: u8 = unsafe { ::core::mem::transmute(READY0) };
            READY0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let READY1: u8 = unsafe { ::core::mem::transmute(READY1) };
            READY1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSB_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type__bindgen_ty_2))
    );
}
impl AC_STATUSB_Type__bindgen_ty_2 {
    #[inline]
    pub fn READY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_READY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(READY: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let READY: u8 = unsafe { ::core::mem::transmute(READY) };
            READY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_STATUSB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_DBGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_DBGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_DBGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_DBGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_DBGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_DBGCTRL_Type__bindgen_ty_1))
    );
}
impl AC_DBGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn DBGRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DBGRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DBGRUN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DBGRUN: u8 = unsafe { ::core::mem::transmute(DBGRUN) };
            DBGRUN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_DBGCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_DBGCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_DBGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_DBGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_DBGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_DBGCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_DBGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_DBGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_WINCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_WINCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_WINCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_WINCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_WINCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_WINCTRL_Type__bindgen_ty_1))
    );
}
impl AC_WINCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn WEN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WEN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINTSEL0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WINTSEL0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WEN0: u8, WINTSEL0: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let WEN0: u8 = unsafe { ::core::mem::transmute(WEN0) };
            WEN0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let WINTSEL0: u8 = unsafe { ::core::mem::transmute(WINTSEL0) };
            WINTSEL0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_WINCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_WINCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_WINCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_WINCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_WINCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_WINCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_WINCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_WINCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_SCALER_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_SCALER_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_SCALER_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AC_SCALER_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_SCALER_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_SCALER_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SCALER_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_SCALER_Type__bindgen_ty_1))
    );
}
impl AC_SCALER_Type__bindgen_ty_1 {
    #[inline]
    pub fn VALUE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_VALUE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(VALUE: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let VALUE: u8 = unsafe { ::core::mem::transmute(VALUE) };
            VALUE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_SCALER_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_SCALER_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_SCALER_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_SCALER_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SCALER_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_SCALER_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SCALER_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SCALER_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_COMPCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_COMPCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct AC_COMPCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_AC_COMPCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_COMPCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(AC_COMPCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_COMPCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_COMPCTRL_Type__bindgen_ty_1))
    );
}
impl AC_COMPCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENABLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SINGLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SINGLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn INTSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_INTSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXNEG(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_MUXNEG(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXPOS(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_MUXPOS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn SWAP(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWAP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPEED(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_SPEED(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn HYSTEN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HYSTEN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HYST(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_HYST(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn FLEN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_FLEN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn OUT(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_OUT(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ENABLE: u32,
        SINGLE: u32,
        INTSEL: u32,
        RUNSTDBY: u32,
        MUXNEG: u32,
        MUXPOS: u32,
        SWAP: u32,
        SPEED: u32,
        HYSTEN: u32,
        HYST: u32,
        FLEN: u32,
        OUT: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u32 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SINGLE: u32 = unsafe { ::core::mem::transmute(SINGLE) };
            SINGLE as u64
        });
        __bindgen_bitfield_unit.set(3usize, 2u8, {
            let INTSEL: u32 = unsafe { ::core::mem::transmute(INTSEL) };
            INTSEL as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let RUNSTDBY: u32 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let MUXNEG: u32 = unsafe { ::core::mem::transmute(MUXNEG) };
            MUXNEG as u64
        });
        __bindgen_bitfield_unit.set(12usize, 3u8, {
            let MUXPOS: u32 = unsafe { ::core::mem::transmute(MUXPOS) };
            MUXPOS as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let SWAP: u32 = unsafe { ::core::mem::transmute(SWAP) };
            SWAP as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let SPEED: u32 = unsafe { ::core::mem::transmute(SPEED) };
            SPEED as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let HYSTEN: u32 = unsafe { ::core::mem::transmute(HYSTEN) };
            HYSTEN as u64
        });
        __bindgen_bitfield_unit.set(20usize, 2u8, {
            let HYST: u32 = unsafe { ::core::mem::transmute(HYST) };
            HYST as u64
        });
        __bindgen_bitfield_unit.set(24usize, 3u8, {
            let FLEN: u32 = unsafe { ::core::mem::transmute(FLEN) };
            FLEN as u64
        });
        __bindgen_bitfield_unit.set(28usize, 2u8, {
            let OUT: u32 = unsafe { ::core::mem::transmute(OUT) };
            OUT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_COMPCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_COMPCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_COMPCTRL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AC_COMPCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_COMPCTRL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_COMPCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_COMPCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_COMPCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_SYNCBUSY_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_SYNCBUSY_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_SYNCBUSY_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct AC_SYNCBUSY_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_AC_SYNCBUSY_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_SYNCBUSY_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(AC_SYNCBUSY_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SYNCBUSY_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_SYNCBUSY_Type__bindgen_ty_1))
    );
}
impl AC_SYNCBUSY_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINCTRL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WINCTRL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPCTRL0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_COMPCTRL0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPCTRL1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_COMPCTRL1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u32,
        ENABLE: u32,
        WINCTRL: u32,
        COMPCTRL0: u32,
        COMPCTRL1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u32 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u32 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINCTRL: u32 = unsafe { ::core::mem::transmute(WINCTRL) };
            WINCTRL as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let COMPCTRL0: u32 = unsafe { ::core::mem::transmute(COMPCTRL0) };
            COMPCTRL0 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let COMPCTRL1: u32 = unsafe { ::core::mem::transmute(COMPCTRL1) };
            COMPCTRL1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct AC_SYNCBUSY_Type__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_AC_SYNCBUSY_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_SYNCBUSY_Type__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(AC_SYNCBUSY_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SYNCBUSY_Type__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_SYNCBUSY_Type__bindgen_ty_2))
    );
}
impl AC_SYNCBUSY_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMPCTRL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_COMPCTRL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMPCTRL: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(3usize, 2u8, {
            let COMPCTRL: u32 = unsafe { ::core::mem::transmute(COMPCTRL) };
            COMPCTRL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_SYNCBUSY_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AC_SYNCBUSY_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AC_SYNCBUSY_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AC_SYNCBUSY_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SYNCBUSY_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_SYNCBUSY_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SYNCBUSY_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SYNCBUSY_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SYNCBUSY_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Ac {
    #[doc = "< \\brief Offset: 0x00 (R/W  8) Control A"]
    pub CTRLA: AC_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x01 ( /W  8) Control B"]
    pub CTRLB: AC_CTRLB_Type,
    #[doc = "< \\brief Offset: 0x02 (R/W 16) Event Control"]
    pub EVCTRL: AC_EVCTRL_Type,
    #[doc = "< \\brief Offset: 0x04 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: AC_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x05 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: AC_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear"]
    pub INTFLAG: AC_INTFLAG_Type,
    #[doc = "< \\brief Offset: 0x07 (R/   8) Status A"]
    pub STATUSA: AC_STATUSA_Type,
    #[doc = "< \\brief Offset: 0x08 (R/   8) Status B"]
    pub STATUSB: AC_STATUSB_Type,
    #[doc = "< \\brief Offset: 0x09 (R/W  8) Debug Control"]
    pub DBGCTRL: AC_DBGCTRL_Type,
    #[doc = "< \\brief Offset: 0x0A (R/W  8) Window Control"]
    pub WINCTRL: AC_WINCTRL_Type,
    pub Reserved1: [RoReg8; 1usize],
    #[doc = "< \\brief Offset: 0x0C (R/W  8) Scaler n"]
    pub SCALER: [AC_SCALER_Type; 2usize],
    pub Reserved2: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x10 (R/W 32) Comparator Control n"]
    pub COMPCTRL: [AC_COMPCTRL_Type; 2usize],
    pub Reserved3: [RoReg8; 8usize],
    #[doc = "< \\brief Offset: 0x20 (R/  32) Synchronization Busy"]
    pub SYNCBUSY: AC_SYNCBUSY_Type,
}
#[test]
fn bindgen_test_layout_Ac() {
    const UNINIT: ::core::mem::MaybeUninit<Ac> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<Ac>(),
        36usize,
        concat!("Size of: ", stringify!(Ac))
    );
    assert_eq!(
        ::core::mem::align_of::<Ac>(),
        4usize,
        concat!("Alignment of ", stringify!(Ac))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLA) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Ac), "::", stringify!(CTRLA))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLB) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(Ac), "::", stringify!(CTRLB))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EVCTRL) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(EVCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENCLR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENSET) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTFLAG) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).STATUSA) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(STATUSA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).STATUSB) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(STATUSB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DBGCTRL) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(DBGCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WINCTRL) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(WINCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SCALER) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(SCALER)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).COMPCTRL) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(COMPCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved3) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SYNCBUSY) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(SYNCBUSY)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLA_Type__bindgen_ty_1))
    );
}
impl ADC_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ONDEMAND(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ONDEMAND(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u8,
        ENABLE: u8,
        RUNSTDBY: u8,
        ONDEMAND: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let RUNSTDBY: u8 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let ONDEMAND: u8 = unsafe { ::core::mem::transmute(ONDEMAND) };
            ONDEMAND as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CTRLA_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_CTRLA_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLA_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLB_Type__bindgen_ty_1))
    );
}
impl ADC_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn PRESCALER(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_PRESCALER(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(PRESCALER: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let PRESCALER: u8 = unsafe { ::core::mem::transmute(PRESCALER) };
            PRESCALER as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CTRLB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_CTRLB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_REFCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_REFCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_REFCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_REFCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_REFCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_REFCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_REFCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_REFCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_REFCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn REFSEL(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_REFSEL(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn REFCOMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_REFCOMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(REFSEL: u8, REFCOMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let REFSEL: u8 = unsafe { ::core::mem::transmute(REFSEL) };
            REFSEL as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let REFCOMP: u8 = unsafe { ::core::mem::transmute(REFCOMP) };
            REFCOMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_REFCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_REFCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_REFCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_REFCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_REFCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_REFCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_REFCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_REFCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_EVCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_EVCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_EVCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_EVCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_EVCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_EVCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_EVCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn FLUSHEI(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_FLUSHEI(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STARTEI(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STARTEI(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FLUSHINV(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_FLUSHINV(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STARTINV(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STARTINV(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RESRDYEO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDYEO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMONEO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMONEO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        FLUSHEI: u8,
        STARTEI: u8,
        FLUSHINV: u8,
        STARTINV: u8,
        RESRDYEO: u8,
        WINMONEO: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let FLUSHEI: u8 = unsafe { ::core::mem::transmute(FLUSHEI) };
            FLUSHEI as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let STARTEI: u8 = unsafe { ::core::mem::transmute(STARTEI) };
            STARTEI as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FLUSHINV: u8 = unsafe { ::core::mem::transmute(FLUSHINV) };
            FLUSHINV as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let STARTINV: u8 = unsafe { ::core::mem::transmute(STARTINV) };
            STARTINV as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let RESRDYEO: u8 = unsafe { ::core::mem::transmute(RESRDYEO) };
            RESRDYEO as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let WINMONEO: u8 = unsafe { ::core::mem::transmute(WINMONEO) };
            WINMONEO as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_EVCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_EVCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_EVCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_EVCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_EVCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_EVCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_EVCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_EVCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENCLR_Type__bindgen_ty_1))
    );
}
impl ADC_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTENCLR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_INTENCLR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENSET_Type__bindgen_ty_1))
    );
}
impl ADC_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTENSET_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_INTENSET_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENSET_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTFLAG_Type__bindgen_ty_1))
    );
}
impl ADC_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTFLAG_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_INTFLAG_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SEQSTATUS_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SEQSTATUS_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SEQSTATUS_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_SEQSTATUS_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SEQSTATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SEQSTATUS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SEQSTATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(ADC_SEQSTATUS_Type__bindgen_ty_1)
        )
    );
}
impl ADC_SEQSTATUS_Type__bindgen_ty_1 {
    #[inline]
    pub fn SEQSTATE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_SEQSTATE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn SEQBUSY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SEQBUSY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SEQSTATE: u8, SEQBUSY: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let SEQSTATE: u8 = unsafe { ::core::mem::transmute(SEQSTATE) };
            SEQSTATE as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SEQBUSY: u8 = unsafe { ::core::mem::transmute(SEQBUSY) };
            SEQBUSY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SEQSTATUS_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_SEQSTATUS_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_SEQSTATUS_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SEQSTATUS_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SEQSTATUS_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SEQSTATUS_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SEQSTATUS_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SEQSTATUS_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INPUTCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INPUTCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INPUTCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_INPUTCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INPUTCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_INPUTCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INPUTCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(ADC_INPUTCTRL_Type__bindgen_ty_1)
        )
    );
}
impl ADC_INPUTCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn MUXPOS(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_MUXPOS(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXNEG(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_MUXNEG(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(MUXPOS: u16, MUXNEG: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let MUXPOS: u16 = unsafe { ::core::mem::transmute(MUXPOS) };
            MUXPOS as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let MUXNEG: u16 = unsafe { ::core::mem::transmute(MUXNEG) };
            MUXNEG as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INPUTCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_INPUTCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_INPUTCTRL_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_INPUTCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INPUTCTRL_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_INPUTCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INPUTCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INPUTCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CTRLC_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CTRLC_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CTRLC_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_CTRLC_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLC_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CTRLC_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLC_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CTRLC_Type__bindgen_ty_1))
    );
}
impl ADC_CTRLC_Type__bindgen_ty_1 {
    #[inline]
    pub fn DIFFMODE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_DIFFMODE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LEFTADJ(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LEFTADJ(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FREERUN(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_FREERUN(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CORREN(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_CORREN(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RESSEL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_RESSEL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn R2R(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_R2R(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMODE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_WINMODE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn DUALSEL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_DUALSEL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        DIFFMODE: u16,
        LEFTADJ: u16,
        FREERUN: u16,
        CORREN: u16,
        RESSEL: u16,
        R2R: u16,
        WINMODE: u16,
        DUALSEL: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DIFFMODE: u16 = unsafe { ::core::mem::transmute(DIFFMODE) };
            DIFFMODE as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let LEFTADJ: u16 = unsafe { ::core::mem::transmute(LEFTADJ) };
            LEFTADJ as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FREERUN: u16 = unsafe { ::core::mem::transmute(FREERUN) };
            FREERUN as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let CORREN: u16 = unsafe { ::core::mem::transmute(CORREN) };
            CORREN as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let RESSEL: u16 = unsafe { ::core::mem::transmute(RESSEL) };
            RESSEL as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let R2R: u16 = unsafe { ::core::mem::transmute(R2R) };
            R2R as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let WINMODE: u16 = unsafe { ::core::mem::transmute(WINMODE) };
            WINMODE as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let DUALSEL: u16 = unsafe { ::core::mem::transmute(DUALSEL) };
            DUALSEL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CTRLC_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_CTRLC_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLC_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CTRLC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLC_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CTRLC_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLC_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLC_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_AVGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_AVGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_AVGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_AVGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_AVGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_AVGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_AVGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_AVGCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_AVGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SAMPLENUM(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_SAMPLENUM(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn ADJRES(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_ADJRES(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SAMPLENUM: u8, ADJRES: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let SAMPLENUM: u8 = unsafe { ::core::mem::transmute(SAMPLENUM) };
            SAMPLENUM as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let ADJRES: u8 = unsafe { ::core::mem::transmute(ADJRES) };
            ADJRES as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_AVGCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_AVGCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_AVGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_AVGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_AVGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_AVGCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AVGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AVGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SAMPCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SAMPCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SAMPCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_SAMPCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SAMPCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SAMPCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SAMPCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SAMPCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_SAMPCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SAMPLEN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_SAMPLEN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn OFFCOMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OFFCOMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SAMPLEN: u8, OFFCOMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let SAMPLEN: u8 = unsafe { ::core::mem::transmute(SAMPLEN) };
            SAMPLEN as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let OFFCOMP: u8 = unsafe { ::core::mem::transmute(OFFCOMP) };
            OFFCOMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SAMPCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_SAMPCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_SAMPCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SAMPCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SAMPCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SAMPCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SAMPCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SAMPCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_WINLT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_WINLT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_WINLT_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_WINLT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINLT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINLT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINLT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINLT_Type__bindgen_ty_1))
    );
}
impl ADC_WINLT_Type__bindgen_ty_1 {
    #[inline]
    pub fn WINLT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_WINLT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WINLT: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let WINLT: u16 = unsafe { ::core::mem::transmute(WINLT) };
            WINLT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_WINLT_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_WINLT_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_WINLT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINLT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINLT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINLT_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINLT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINLT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_WINUT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_WINUT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_WINUT_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_WINUT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINUT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINUT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINUT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINUT_Type__bindgen_ty_1))
    );
}
impl ADC_WINUT_Type__bindgen_ty_1 {
    #[inline]
    pub fn WINUT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_WINUT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WINUT: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let WINUT: u16 = unsafe { ::core::mem::transmute(WINUT) };
            WINUT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_WINUT_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_WINUT_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_WINUT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINUT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINUT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINUT_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINUT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINUT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_GAINCORR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_GAINCORR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_GAINCORR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_GAINCORR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_GAINCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_GAINCORR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_GAINCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_GAINCORR_Type__bindgen_ty_1))
    );
}
impl ADC_GAINCORR_Type__bindgen_ty_1 {
    #[inline]
    pub fn GAINCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_GAINCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(GAINCORR: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let GAINCORR: u16 = unsafe { ::core::mem::transmute(GAINCORR) };
            GAINCORR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_GAINCORR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_GAINCORR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_GAINCORR_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_GAINCORR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_GAINCORR_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_GAINCORR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_GAINCORR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_GAINCORR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_OFFSETCORR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_OFFSETCORR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_OFFSETCORR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_OFFSETCORR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_OFFSETCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_OFFSETCORR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_OFFSETCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(ADC_OFFSETCORR_Type__bindgen_ty_1)
        )
    );
}
impl ADC_OFFSETCORR_Type__bindgen_ty_1 {
    #[inline]
    pub fn OFFSETCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_OFFSETCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(OFFSETCORR: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let OFFSETCORR: u16 = unsafe { ::core::mem::transmute(OFFSETCORR) };
            OFFSETCORR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_OFFSETCORR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_OFFSETCORR_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_OFFSETCORR_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_OFFSETCORR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_OFFSETCORR_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_OFFSETCORR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OFFSETCORR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OFFSETCORR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SWTRIG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SWTRIG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SWTRIG_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_SWTRIG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SWTRIG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SWTRIG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SWTRIG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SWTRIG_Type__bindgen_ty_1))
    );
}
impl ADC_SWTRIG_Type__bindgen_ty_1 {
    #[inline]
    pub fn FLUSH(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_FLUSH(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn START(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(FLUSH: u8, START: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let FLUSH: u8 = unsafe { ::core::mem::transmute(FLUSH) };
            FLUSH as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let START: u8 = unsafe { ::core::mem::transmute(START) };
            START as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SWTRIG_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_SWTRIG_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_SWTRIG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SWTRIG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SWTRIG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SWTRIG_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SWTRIG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SWTRIG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_DBGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_DBGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_DBGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_ADC_DBGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_DBGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_DBGCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_DBGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn DBGRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DBGRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DBGRUN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DBGRUN: u8 = unsafe { ::core::mem::transmute(DBGRUN) };
            DBGRUN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_DBGCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_DBGCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_DBGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_DBGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_DBGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_DBGCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_DBGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_DBGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SYNCBUSY_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SYNCBUSY_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SYNCBUSY_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_SYNCBUSY_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SYNCBUSY_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_SYNCBUSY_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SYNCBUSY_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_SYNCBUSY_Type__bindgen_ty_1))
    );
}
impl ADC_SYNCBUSY_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn INPUTCTRL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_INPUTCTRL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CTRLC(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_CTRLC(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn AVGCTRL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_AVGCTRL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SAMPCTRL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_SAMPCTRL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINLT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINLT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINUT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINUT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GAINCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_GAINCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OFFSETCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_OFFSETCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_SWTRIG(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u16,
        ENABLE: u16,
        INPUTCTRL: u16,
        CTRLC: u16,
        AVGCTRL: u16,
        SAMPCTRL: u16,
        WINLT: u16,
        WINUT: u16,
        GAINCORR: u16,
        OFFSETCORR: u16,
        SWTRIG: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u16 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u16 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let INPUTCTRL: u16 = unsafe { ::core::mem::transmute(INPUTCTRL) };
            INPUTCTRL as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let CTRLC: u16 = unsafe { ::core::mem::transmute(CTRLC) };
            CTRLC as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let AVGCTRL: u16 = unsafe { ::core::mem::transmute(AVGCTRL) };
            AVGCTRL as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let SAMPCTRL: u16 = unsafe { ::core::mem::transmute(SAMPCTRL) };
            SAMPCTRL as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let WINLT: u16 = unsafe { ::core::mem::transmute(WINLT) };
            WINLT as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let WINUT: u16 = unsafe { ::core::mem::transmute(WINUT) };
            WINUT as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let GAINCORR: u16 = unsafe { ::core::mem::transmute(GAINCORR) };
            GAINCORR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let OFFSETCORR: u16 = unsafe { ::core::mem::transmute(OFFSETCORR) };
            OFFSETCORR as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let SWTRIG: u16 = unsafe { ::core::mem::transmute(SWTRIG) };
            SWTRIG as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SYNCBUSY_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_SYNCBUSY_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_SYNCBUSY_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_SYNCBUSY_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SYNCBUSY_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_SYNCBUSY_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SYNCBUSY_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SYNCBUSY_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_RESULT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_RESULT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_RESULT_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_RESULT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_RESULT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_RESULT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_RESULT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_RESULT_Type__bindgen_ty_1))
    );
}
impl ADC_RESULT_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESULT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_RESULT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(RESULT: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let RESULT: u16 = unsafe { ::core::mem::transmute(RESULT) };
            RESULT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_RESULT_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_RESULT_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_RESULT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_RESULT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_RESULT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_RESULT_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_RESULT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_RESULT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SEQCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SEQCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SEQCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_ADC_SEQCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SEQCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ADC_SEQCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SEQCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_SEQCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_SEQCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SEQEN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_SEQEN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SEQEN: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let SEQEN: u32 = unsafe { ::core::mem::transmute(SEQEN) };
            SEQEN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SEQCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_SEQCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_SEQCTRL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(ADC_SEQCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SEQCTRL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_SEQCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SEQCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SEQCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CALIB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CALIB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CALIB_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_ADC_CALIB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CALIB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CALIB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CALIB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CALIB_Type__bindgen_ty_1))
    );
}
impl ADC_CALIB_Type__bindgen_ty_1 {
    #[inline]
    pub fn BIASCOMP(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_BIASCOMP(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn BIASREFBUF(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_BIASREFBUF(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(BIASCOMP: u16, BIASREFBUF: u16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let BIASCOMP: u16 = unsafe { ::core::mem::transmute(BIASCOMP) };
            BIASCOMP as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let BIASREFBUF: u16 = unsafe { ::core::mem::transmute(BIASREFBUF) };
            BIASREFBUF as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CALIB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<ADC_CALIB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ADC_CALIB_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CALIB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CALIB_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CALIB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CALIB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CALIB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Adc {
    #[doc = "< \\brief Offset: 0x00 (R/W  8) Control A"]
    pub CTRLA: ADC_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x01 (R/W  8) Control B"]
    pub CTRLB: ADC_CTRLB_Type,
    #[doc = "< \\brief Offset: 0x02 (R/W  8) Reference Control"]
    pub REFCTRL: ADC_REFCTRL_Type,
    #[doc = "< \\brief Offset: 0x03 (R/W  8) Event Control"]
    pub EVCTRL: ADC_EVCTRL_Type,
    #[doc = "< \\brief Offset: 0x04 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: ADC_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x05 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: ADC_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear"]
    pub INTFLAG: ADC_INTFLAG_Type,
    #[doc = "< \\brief Offset: 0x07 (R/   8) Sequence Status"]
    pub SEQSTATUS: ADC_SEQSTATUS_Type,
    #[doc = "< \\brief Offset: 0x08 (R/W 16) Input Control"]
    pub INPUTCTRL: ADC_INPUTCTRL_Type,
    #[doc = "< \\brief Offset: 0x0A (R/W 16) Control C"]
    pub CTRLC: ADC_CTRLC_Type,
    #[doc = "< \\brief Offset: 0x0C (R/W  8) Average Control"]
    pub AVGCTRL: ADC_AVGCTRL_Type,
    #[doc = "< \\brief Offset: 0x0D (R/W  8) Sample Time Control"]
    pub SAMPCTRL: ADC_SAMPCTRL_Type,
    #[doc = "< \\brief Offset: 0x0E (R/W 16) Window Monitor Lower Threshold"]
    pub WINLT: ADC_WINLT_Type,
    #[doc = "< \\brief Offset: 0x10 (R/W 16) Window Monitor Upper Threshold"]
    pub WINUT: ADC_WINUT_Type,
    #[doc = "< \\brief Offset: 0x12 (R/W 16) Gain Correction"]
    pub GAINCORR: ADC_GAINCORR_Type,
    #[doc = "< \\brief Offset: 0x14 (R/W 16) Offset Correction"]
    pub OFFSETCORR: ADC_OFFSETCORR_Type,
    pub Reserved1: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x18 (R/W  8) Software Trigger"]
    pub SWTRIG: ADC_SWTRIG_Type,
    pub Reserved2: [RoReg8; 3usize],
    #[doc = "< \\brief Offset: 0x1C (R/W  8) Debug Control"]
    pub DBGCTRL: ADC_DBGCTRL_Type,
    pub Reserved3: [RoReg8; 3usize],
    #[doc = "< \\brief Offset: 0x20 (R/  16) Synchronization Busy"]
    pub SYNCBUSY: ADC_SYNCBUSY_Type,
    pub Reserved4: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x24 (R/  16) Result"]
    pub RESULT: ADC_RESULT_Type,
    pub Reserved5: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x28 (R/W 32) Sequence Control"]
    pub SEQCTRL: ADC_SEQCTRL_Type,
    #[doc = "< \\brief Offset: 0x2C (R/W 16) Calibration"]
    pub CALIB: ADC_CALIB_Type,
}
#[test]
fn bindgen_test_layout_Adc() {
    const UNINIT: ::core::mem::MaybeUninit<Adc> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<Adc>(),
        48usize,
        concat!("Size of: ", stringify!(Adc))
    );
    assert_eq!(
        ::core::mem::align_of::<Adc>(),
        4usize,
        concat!("Alignment of ", stringify!(Adc))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLA) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CTRLA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLB) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CTRLB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).REFCTRL) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(REFCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EVCTRL) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(EVCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENCLR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENSET) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTFLAG) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SEQSTATUS) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SEQSTATUS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INPUTCTRL) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INPUTCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLC) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CTRLC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AVGCTRL) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(AVGCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SAMPCTRL) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SAMPCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WINLT) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(WINLT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WINUT) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(WINUT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GAINCORR) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(GAINCORR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OFFSETCORR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(OFFSETCORR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SWTRIG) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SWTRIG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DBGCTRL) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(DBGCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved3) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SYNCBUSY) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SYNCBUSY)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved4) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESULT) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(RESULT)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved5) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SEQCTRL) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SEQCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CALIB) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CALIB)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct AES_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_AES_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_CTRLA_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(AES_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_CTRLA_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_CTRLA_Type__bindgen_ty_1))
    );
}
impl AES_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn AESMODE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_AESMODE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn CFBS(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_CFBS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn KEYSIZE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_KEYSIZE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn CIPHER(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CIPHER(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STARTMODE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_STARTMODE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LOD(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_LOD(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn KEYGEN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_KEYGEN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn XORKEY(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_XORKEY(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CTYPE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_CTYPE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u32,
        ENABLE: u32,
        AESMODE: u32,
        CFBS: u32,
        KEYSIZE: u32,
        CIPHER: u32,
        STARTMODE: u32,
        LOD: u32,
        KEYGEN: u32,
        XORKEY: u32,
        CTYPE: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u32 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u32 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 3u8, {
            let AESMODE: u32 = unsafe { ::core::mem::transmute(AESMODE) };
            AESMODE as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let CFBS: u32 = unsafe { ::core::mem::transmute(CFBS) };
            CFBS as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let KEYSIZE: u32 = unsafe { ::core::mem::transmute(KEYSIZE) };
            KEYSIZE as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let CIPHER: u32 = unsafe { ::core::mem::transmute(CIPHER) };
            CIPHER as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let STARTMODE: u32 = unsafe { ::core::mem::transmute(STARTMODE) };
            STARTMODE as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let LOD: u32 = unsafe { ::core::mem::transmute(LOD) };
            LOD as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let KEYGEN: u32 = unsafe { ::core::mem::transmute(KEYGEN) };
            KEYGEN as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let XORKEY: u32 = unsafe { ::core::mem::transmute(XORKEY) };
            XORKEY as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let CTYPE: u32 = unsafe { ::core::mem::transmute(CTYPE) };
            CTYPE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_CTRLA_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_CTRLA_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_CTRLA_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_CTRLA_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_CTRLA_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_CTRLB_Type__bindgen_ty_1))
    );
}
impl AES_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn START(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn NEWMSG(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_NEWMSG(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EOM(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EOM(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GFMUL(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GFMUL(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        START: u8,
        NEWMSG: u8,
        EOM: u8,
        GFMUL: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let START: u8 = unsafe { ::core::mem::transmute(START) };
            START as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let NEWMSG: u8 = unsafe { ::core::mem::transmute(NEWMSG) };
            NEWMSG as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let EOM: u8 = unsafe { ::core::mem::transmute(EOM) };
            EOM as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let GFMUL: u8 = unsafe { ::core::mem::transmute(GFMUL) };
            GFMUL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_CTRLB_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_CTRLB_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_CTRLB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_CTRLB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_CTRLB_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTENCLR_Type__bindgen_ty_1))
    );
}
impl AES_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENCCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENCCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GFMCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GFMCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ENCCMP: u8, GFMCMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ENCCMP: u8 = unsafe { ::core::mem::transmute(ENCCMP) };
            ENCCMP as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let GFMCMP: u8 = unsafe { ::core::mem::transmute(GFMCMP) };
            GFMCMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_INTENCLR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_INTENCLR_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTENSET_Type__bindgen_ty_1))
    );
}
impl AES_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENCCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENCCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GFMCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GFMCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ENCCMP: u8, GFMCMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ENCCMP: u8 = unsafe { ::core::mem::transmute(ENCCMP) };
            ENCCMP as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let GFMCMP: u8 = unsafe { ::core::mem::transmute(GFMCMP) };
            GFMCMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_INTENSET_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_INTENSET_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTENSET_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTFLAG_Type__bindgen_ty_1))
    );
}
impl AES_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENCCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENCCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GFMCMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GFMCMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ENCCMP: u8, GFMCMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ENCCMP: u8 = unsafe { ::core::mem::transmute(ENCCMP) };
            ENCCMP as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let GFMCMP: u8 = unsafe { ::core::mem::transmute(GFMCMP) };
            GFMCMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_INTFLAG_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_INTFLAG_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_DATABUFPTR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_DATABUFPTR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_DATABUFPTR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_DATABUFPTR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_DATABUFPTR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_DATABUFPTR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_DATABUFPTR_Type__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(AES_DATABUFPTR_Type__bindgen_ty_1)
        )
    );
}
impl AES_DATABUFPTR_Type__bindgen_ty_1 {
    #[inline]
    pub fn INDATAPTR(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_INDATAPTR(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(INDATAPTR: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let INDATAPTR: u8 = unsafe { ::core::mem::transmute(INDATAPTR) };
            INDATAPTR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_DATABUFPTR_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_DATABUFPTR_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_DATABUFPTR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_DATABUFPTR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_DATABUFPTR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_DATABUFPTR_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_DATABUFPTR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_DATABUFPTR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_DBGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AES_DBGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AES_DBGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_AES_DBGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AES_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AES_DBGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_DBGCTRL_Type__bindgen_ty_1))
    );
}
impl AES_DBGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn DBGRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DBGRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DBGRUN: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DBGRUN: u8 = unsafe { ::core::mem::transmute(DBGRUN) };
            DBGRUN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AES_DBGCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_DBGCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_DBGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AES_DBGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_DBGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AES_DBGCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_DBGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_DBGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_KEYWORD_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_KEYWORD_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_KEYWORD_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_KEYWORD_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_KEYWORD_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_KEYWORD_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_KEYWORD_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_KEYWORD_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_INDATA_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_INDATA_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_INDATA_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_INDATA_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_INDATA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INDATA_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_INDATA_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INDATA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_INTVECTV_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_INTVECTV_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_INTVECTV_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_INTVECTV_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_INTVECTV_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_INTVECTV_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_INTVECTV_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_INTVECTV_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_HASHKEY_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_HASHKEY_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_HASHKEY_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_HASHKEY_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_HASHKEY_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_HASHKEY_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_HASHKEY_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_HASHKEY_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_GHASH_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_GHASH_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_GHASH_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_GHASH_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_GHASH_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_GHASH_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_GHASH_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_GHASH_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_CIPLEN_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_CIPLEN_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_CIPLEN_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_CIPLEN_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_CIPLEN_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_CIPLEN_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_CIPLEN_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_CIPLEN_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AES_RANDSEED_Type {
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[test]
fn bindgen_test_layout_AES_RANDSEED_Type() {
    const UNINIT: ::core::mem::MaybeUninit<AES_RANDSEED_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<AES_RANDSEED_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AES_RANDSEED_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AES_RANDSEED_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AES_RANDSEED_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AES_RANDSEED_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Aes {
    #[doc = "< \\brief Offset: 0x00 (R/W 32) Control A"]
    pub CTRLA: AES_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x04 (R/W  8) Control B"]
    pub CTRLB: AES_CTRLB_Type,
    #[doc = "< \\brief Offset: 0x05 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: AES_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x06 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: AES_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x07 (R/W  8) Interrupt Flag Status"]
    pub INTFLAG: AES_INTFLAG_Type,
    #[doc = "< \\brief Offset: 0x08 (R/W  8) Data buffer pointer"]
    pub DATABUFPTR: AES_DATABUFPTR_Type,
    #[doc = "< \\brief Offset: 0x09 ( /W  8) Debug control"]
    pub DBGCTRL: AES_DBGCTRL_Type,
    pub Reserved1: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x0C ( /W 32) Keyword n"]
    pub KEYWORD: [AES_KEYWORD_Type; 8usize],
    pub Reserved2: [RoReg8; 12usize],
    #[doc = "< \\brief Offset: 0x38 (R/W 32) Indata"]
    pub INDATA: AES_INDATA_Type,
    #[doc = "< \\brief Offset: 0x3C ( /W 32) Initialisation Vector n"]
    pub INTVECTV: [AES_INTVECTV_Type; 4usize],
    pub Reserved3: [RoReg8; 16usize],
    #[doc = "< \\brief Offset: 0x5C (R/W 32) Hash key n"]
    pub HASHKEY: [AES_HASHKEY_Type; 4usize],
    #[doc = "< \\brief Offset: 0x6C (R/W 32) Galois Hash n"]
    pub GHASH: [AES_GHASH_Type; 4usize],
    pub Reserved4: [RoReg8; 4usize],
    #[doc = "< \\brief Offset: 0x80 (R/W 32) Cipher Length"]
    pub CIPLEN: AES_CIPLEN_Type,
    #[doc = "< \\brief Offset: 0x84 (R/W 32) Random Seed"]
    pub RANDSEED: AES_RANDSEED_Type,
}
#[test]
fn bindgen_test_layout_Aes() {
    const UNINIT: ::core::mem::MaybeUninit<Aes> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<Aes>(),
        136usize,
        concat!("Size of: ", stringify!(Aes))
    );
    assert_eq!(
        ::core::mem::align_of::<Aes>(),
        4usize,
        concat!("Alignment of ", stringify!(Aes))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLA) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(CTRLA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CTRLB) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(CTRLB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENCLR) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTENSET) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTFLAG) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DATABUFPTR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(DATABUFPTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DBGCTRL) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(DBGCTRL)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).KEYWORD) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(KEYWORD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INDATA) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(INDATA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).INTVECTV) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(INTVECTV)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved3) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(Reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HASHKEY) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(HASHKEY)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GHASH) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(GHASH)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved4) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(Reserved4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CIPLEN) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(CIPLEN)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RANDSEED) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(Aes),
            "::",
            stringify!(RANDSEED)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CCL_CTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: CCL_CTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CCL_CTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_CCL_CTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CCL_CTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(CCL_CTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CCL_CTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(CCL_CTRL_Type__bindgen_ty_1))
    );
}
impl CCL_CTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u8,
        ENABLE: u8,
        RUNSTDBY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let RUNSTDBY: u8 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CCL_CTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<CCL_CTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CCL_CTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(CCL_CTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CCL_CTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(CCL_CTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCL_CTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCL_CTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CCL_SEQCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: CCL_SEQCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CCL_SEQCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_CCL_SEQCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CCL_SEQCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(CCL_SEQCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CCL_SEQCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(CCL_SEQCTRL_Type__bindgen_ty_1))
    );
}
impl CCL_SEQCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SEQSEL(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_SEQSEL(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SEQSEL: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let SEQSEL: u8 = unsafe { ::core::mem::transmute(SEQSEL) };
            SEQSEL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CCL_SEQCTRL_Type() {
    const UNINIT: ::core::mem::MaybeUninit<CCL_SEQCTRL_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CCL_SEQCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(CCL_SEQCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CCL_SEQCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(CCL_SEQCTRL_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCL_SEQCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CCL_SEQCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CCL_LUTCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: CCL_LUTCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct CCL_LUTCTRL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_CCL_LUTCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CCL_LUTCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CCL_LUTCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CCL_LUTCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CCL_LUTCTRL_Type__bindgen_ty_1))
    );
}
impl CCL_LUTCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENABLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FILTSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_FILTSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn EDGESEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_EDGESEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn INSEL0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_INSEL0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn INSEL1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_INSEL1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn INSEL2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_INSEL2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn INVEI(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_INVEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LUTEI(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_LUTEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LUTEO(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_LUTEO(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn TRUTH(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_TRUTH(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ENABLE: u32,
        FILTSEL: u32,
        EDGESEL: u32,
        INSEL0: u32,
        INSEL1: u32,
        INSEL2: u32,
        INVEI: u32,
        LUTEI: u32,
        LUTEO: u32,
        TRUTH: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u32 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let FILTSEL: u32 = unsafe { ::core::mem::transmute(FILTSEL) };
            FILTSEL as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let EDGESEL: u32 = unsafe { ::core::mem::transmute(EDGESEL) };
            EDGESEL as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let INSEL0: u32 = unsafe { ::core::mem::transmute(INSEL0) };
            INSEL0 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let INSEL1: u32 = unsafe { ::core::mem::transmute(INSEL1) };
            INSEL1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let INSEL2: u32 = unsafe { ::core::mem::transmute(INSEL2) };
            INSEL2 as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let INVEI: u32 = unsafe { ::core::mem::transmute(INVEI) };
            INVEI as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let LUTEI: u32 = unsafe { ::core::mem::transmute(LUTEI) };
            LUTEI as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let LUTEO: u32 = unsafe { ::core::mem::transmute(LUTEO) };
            LUTEO as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let TRUTH: u32 = unsafe { ::core::mem::transmute(TRUTH) };
            TRUTH as u64
        });
